Para esta páctica usaremos la base de datos `Pruebas`

In [1]:
--Ejecute este bloque(colapsado) para usarla 

IF NOT EXISTS 
   (
     SELECT name FROM master.dbo.sysdatabases 
     WHERE name = 'Pruebas'
    )
CREATE DATABASE Pruebas

GO
use Pruebas

# Restricciones ( Constraints )

Una restriccion puede ser a nivel Columna

In [2]:

CREATE TABLE RCT1
(
    NombreCompleto VARCHAR(30) not NULL PRIMARY KEY, 
    Departamento varchar(30),
    Salario NUMERIC (10,4)
)

: Msg 2714, Level 16, State 6, Line 2
There is already an object named 'RCT1' in the database.

O a nivel Tabla

In [3]:
CREATE TABLE TT1
(
    Nombre VARCHAR(30) not NULL, 
    Apellido VARCHAR(30),
    Departamento varchar(30),
    Salario NUMERIC (10,4)
    PRIMARY KEY (Nombre,Apellido)
)

# Constraint Default 
A una columna se le puede asignar un valor, en caso de que el usuario no provea uno. Por ejemplo, en una empresa de origen mexicano, en el atributo `País` el valor por defecto bien podría ser `México`.

In [4]:
CREATE TABLE Empleados
(
    IdEmpleado int PRIMARY KEY,
    Nombre NVARCHAR(30) not NULL, 
    Apellido NVARCHAR(30),
    Pais NVARCHAR(50) DEFAULT 'México'
)

In [5]:
INSERT INTO Empleados (idEmpleado, Nombre, Apellido) 
    VALUES (1, 'Juan', 'Pérez')
INSERT INTO Empleados (idEmpleado, Nombre, Apellido, Pais) 
    VALUES (2, 'Francisco', 'Hernández', 'Estados Unidos')

In [6]:
SELECT * from Empleados

IdEmpleado,Nombre,Apellido,Pais
1,Juan,Pérez,México
2,Francisco,Hernández,Estados Unidos

# Default cuando la tabla ya tiene datos

In [7]:
ALTER TABLE Empleados
    Add Departamento nvarchar(30) DEFAULT 'Ventas'

SELECT * from Empleados

IdEmpleado,Nombre,Apellido,Pais,Departamento
1,Juan,Pérez,México,NULL
2,Francisco,Hernández,Estados Unidos,NULL

# WITH VALUES

In [3]:
ALTER TABLE Empleados
    add Salario NUMERIC(10,4) DEFAULT 900.200 WITH VALUES

SELECT * from Empleados

: Msg 2705, Level 16, State 4, Line 1
Column names in each table must be unique. Column name 'Salario' in table 'Empleados' is specified more than once.